# DVD Rental database:

There are 15 tables .

__actor__ – stores actors data including first name and last name.<br>
__film__ – stores films data such as title, release year, length, rating, etc.<br>
__film_actor__ – stores the relationships between films and actors.<br>
__category__ – stores film’s categories data.<br>
__film_category__- stores the relationships between films and categories.<br>
__store__ – contains the store data including manager staff and address.<br>
__inventory__ – stores inventory data.<br>
__rental__ – stores rental data.<br>
__payment__ – stores customer’s payments.<br>
__staff__ – stores staff data.<br>
__customer__– stores customers data.<br>
__address__ – stores address data for staff and customers<br>
__city__ – stores the city names.<br>
__country__ – stores the country names.<br>

In [83]:
import psycopg2
import pandas as pd

In [69]:
connection = psycopg2.connect(user = "postgres",
                                  password = "12345",
                                  host = "localhost",
                                  database = "med_rpr_stg")

In [70]:
cursor = connection.cursor()
# Print PostgreSQL Connection properties
print ( connection.get_dsn_parameters(),"\n")

{'user': 'postgres', 'dbname': 'med_rpr_stg', 'host': 'localhost', 'port': '5432', 'tty': '', 'options': '', 'sslmode': 'prefer', 'sslcompression': '0', 'krbsrvname': 'postgres', 'target_session_attrs': 'any'}

## Business Question

#### 1) What are total sales for top and least rented( in _ demand ) genres?

In [87]:
# Print PostgreSQL version
select_Business_1 = cursor.execute('''select table1.genre, table1.total_rent_demand, table2.total_sales
                                    from 
                                    (select c.name AS Genre, count(cu.customer_id) AS Total_rent_demand
                                    FROM category c 
                                    JOIN film_category fc
                                    on c.category_id = fc.category_id
                                    JOIN film f
                                    on f.film_id = fc.film_id
                                    JOIN inventory i
                                    on i.film_id = fc.film_id
                                    JOIN rental r
                                    on r.inventory_id = i.inventory_id
                                    JOIN customer cu
                                    on cu.customer_id = r.customer_id
                                    GROUP BY 1
                                    ORDER BY 2 DESC) table1 
                                    join (
                                    select c.name AS Genre, SUM(p.amount) AS total_sales
                                    FROM category c 
                                    JOIN film_category fc
                                    on c.category_id = fc.category_id
                                    JOIN film f
                                    on f.film_id = fc.film_id
                                    JOIN inventory i
                                    on i.film_id = fc.film_id
                                    JOIN rental r
                                    on r.inventory_id = i.inventory_id
                                    JOIN payment p
                                    on p.rental_id = r.rental_id
                                    GROUP BY 1
                                    ORDER BY 2 DESC) table2
                                    on  table1.genre = table2.genre;''')


Business_1 = cursor.fetchall() 

dfObj = pd.DataFrame(Business_1) 
print(dfObj)

              0     1        2
0        Sports  1179  4892.19
1     Animation  1166  4245.31
2        Action  1112  3951.84
3        Sci-Fi  1101  4336.01
4        Family  1096  3830.15
5         Drama  1060  4118.46
6   Documentary  1050  3749.65
7       Foreign  1033  3934.47
8         Games   969  3922.18
9      Children   945  3309.39
10       Comedy   941  4002.48
11          New   940  3966.38
12     Classics   939  3353.38
13       Horror   846  3401.27
14       Travel   837  3227.36
15        Music   830  3071.52

#### 2) Distinct users have rented each genre?

In [88]:
# Print PostgreSQL version
select_Business_2 = cursor.execute('''SELECT c.name AS Genre, count(DISTINCT cu.customer_id) AS Total_rent_demand
                    FROM category c 
                    JOIN film_category fc
                    on c.category_id = fc.category_id
                    JOIN film f
                    on f.film_id = fc.film_id
                    JOIN inventory i
                    on i.film_id = fc.film_id
                    JOIN rental r
                    on r.inventory_id = i.inventory_id
                    JOIN customer cu
                    on cu.customer_id = r.customer_id
                    GROUP BY 1
                    ORDER BY 2 DESC;''')


Business_2 = cursor.fetchall() 

dfObj = pd.DataFrame(Business_2) 
print(dfObj)

              0    1
0        Sports  519
1        Action  510
2        Sci-Fi  507
3        Family  501
4         Drama  501
5     Animation  500
6        Comedy  495
7       Foreign  493
8   Documentary  483
9      Children  482
10        Games  474
11          New  468
12     Classics  468
13       Horror  451
14        Music  447
15       Travel  442

#### 3) Avg. Rental rate for each genre ?

In [89]:
# Print PostgreSQL version
select_Business_3 = cursor.execute('''SELECT c.name AS genre, ROUND(AVG(f.rental_rate),2) AS Average_rental_rate
                            FROM category c 
                            JOIN film_category fc
                            on c.category_id = fc.category_id
                            JOIN film f
                            on f.film_id = fc.film_id
                            GROUP BY 1
                            ORDER BY 2 DESC;''')


Business_3 = cursor.fetchall() 

dfObj = pd.DataFrame(Business_3) 
print(dfObj)

              0     1
0         Games  3.25
1        Travel  3.24
2        Sci-Fi  3.22
3        Comedy  3.16
4        Sports  3.13
5           New  3.12
6       Foreign  3.10
7        Horror  3.03
8         Drama  3.02
9         Music  2.95
10     Children  2.89
11    Animation  2.81
12       Family  2.76
13     Classics  2.74
14  Documentary  2.67
15       Action  2.65

#### 4) In which countries does Rent A Film have a presence and what is the customer base in each country? What are the total sales in each country?

In [90]:
# Print PostgreSQL version
select_Business_4 = cursor.execute('''SELECT co.country, count(DISTINCT cu.customer_id) AS customer_base, SUM(amount) AS total_sales
                                    FROM country co 
                                    JOIN city ci
                                    ON co.country_id = ci.country_id
                                    JOIN address a 
                                    on ci.city_id = a.city_id
                                    JOIN customer cu
                                    on cu.address_id = a.address_id
                                    JOIN payment p
                                    on p.customer_id = cu.customer_id
                                    GROUP BY 1
                                    ORDER BY 2 DESC;''')


Business_4 = cursor.fetchall() 

dfObj = pd.DataFrame(Business_4) 
print(dfObj)

                                    0   1        2
0                               India  60  6034.78
1                               China  53  5251.03
2                       United States  36  3685.31
3                               Japan  31  3122.51
4                              Mexico  30  2984.82
5                              Brazil  28  2919.19
6                  Russian Federation  28  2765.62
7                         Philippines  20  2219.70
8                              Turkey  15  1498.49
9                           Indonesia  14  1352.69
10                            Nigeria  13  1314.92
11                          Argentina  13  1298.80
12                       South Africa  11  1069.46
13                             Taiwan  10  1155.10
14                     United Kingdom   9   850.96
15                               Iran   8   877.96
16                             Poland   8   786.16
17                              Italy   7   753.26
18                            Germany   7   741.24
19                          Venezuela   7   632.43
20                              Egypt   6   659.48
21                            Ukraine   6   675.53
22                            Vietnam   6   676.45
23                           Colombia   6   661.54
24                              Spain   5   513.80
25                             Canada   5   559.70
26                       Saudi Arabia   5   452.94
27                        Netherlands   5   557.73
28                           Pakistan   5   473.84
29                        South Korea   5   527.77
..                                ...  ..      ...
78                            Finland   1    78.79
79                      French Guiana   1    97.80
80                             Gambia   1   114.73
81                          Greenland   1   119.72
82      Holy See (Vatican City State)   1   146.68
83                          Hong Kong   1   104.76
84                            Hungary   1   111.71
85                               Iraq   1   111.73
86                             Kuwait   1   106.75
87                      Liechtenstein   1    99.74
88                          Lithuania   1    63.78
89                         Madagascar   1    92.79
90                             Malawi   1   121.73
91                            Moldova   1   127.66
92                              Nauru   1   143.70
93                              Nepal   1    93.83
94                        New Zealand   1    85.77
95                        North Korea   1   107.71
96                             Runion   1   211.55
97   Saint Vincent and the Grenadines   1    64.82
98                            Senegal   1    95.76
99                           Slovakia   1    80.77
100                         Sri Lanka   1   103.73
101                            Sweden   1   139.67
102                             Tonga   1    64.84
103                           Tunisia   1    73.78
104                      Turkmenistan   1   126.74
105                            Tuvalu   1    93.78
106              Virgin Islands, U.S.   1   121.69
107                       Afghanistan   1    67.82

[108 rows x 3 columns]

#### 5) The top 5 customers per total sales and can we get their details just in case Rent A Film wants to reward them?

In [94]:
# Print PostgreSQL version
select_Business_5 = cursor.execute('''SELECT full_name, email, address, phone, city, country, sum(amount) AS total_purchase_in_currency
                                    FROM (SELECT *, first_name || ' ' || last_name AS full_name FROM customer) t1
                                    JOIN address a
                                    ON t1.address_id = a.address_id
                                    JOIN city ci
                                    on ci.city_id = a.city_id
                                    JOIN country co
                                    ON co.country_id = ci.country_id
                                    JOIN payment p
                                    on p.customer_id = t1.customer_id
                                    GROUP BY 1,2,3,4,5,6
                                    ORDER BY 7 DESC
                                    LIMIT 5;''')


Business_5 = cursor.fetchall() 

dfObj = pd.DataFrame(Business_5) 
print(dfObj)

                0                                  1                      2  \
0    Eleanor Hunt    eleanor.hunt@sakilacustomer.org         1952 Pune Lane
1       Karl Seal       karl.seal@sakilacustomer.org       1427 Tabuk Place
2   Marion Snyder   marion.snyder@sakilacustomer.org  1891 Rizhao Boulevard
3  Rhonda Kennedy  rhonda.kennedy@sakilacustomer.org      1749 Daxian Place
4      Clara Shaw      clara.shaw@sakilacustomer.org    1027 Songkhla Manor

              3                    4              5       6
0  354615066969          Saint-Denis         Runion  211.55
1  214756839122           Cape Coral  United States  208.58
2  391065549876  Santa Brbara dOeste         Brazil  194.61
3  963369996279            Apeldoorn    Netherlands  191.62
4  563660187896            Molodetno        Belarus  189.60